Repository: franzos/formshive-wordpress
Catalog: languages/formshive-*.po
Languages: ar, es_es

source: Formshive requires WordPress version 5.0 or higher.
ar: يتطلب Formshive إصدار WordPress 5.0 أو أعلى.
es_es: Formshive requiere WordPress versión 5.0 o superior.

source: Forms
ar: النماذج
es_es: Formularios

source: All Forms
ar: جميع النماذج
es_es: Todos los formularios

source: Add New Form
ar: إضافة نموذج جديد
es_es: Añadir nuevo formulario

source: Edit Form
ar: تحرير النموذج
es_es: Editar formulario

source: New Form
ar: نموذج جديد
es_es: Nuevo formulario

source: View Form
ar: عرض النموذج
es_es: Ver formulario

source: View Forms
ar: عرض النماذج
es_es: Ver formularios

source: Search Forms
ar: البحث في النماذج
es_es: Buscar formularios

source: No forms found
ar: لم يتم العثور على نماذج
es_es: No se encontraron formularios

source: No forms found in Trash
ar: لم يتم العثور على نماذج في سلة المهملات
es_es: No se encontraron formularios en la papelera

source: Settings
ar: الإعدادات
es_es: Configuración

source: Form saved successfully!
ar: تم حفظ النموذج بنجاح!
es_es: ¡Formulario guardado exitosamente!

source: Error saving form. Please try again.
ar: خطأ في حفظ النموذج. يرجى المحاولة مرة أخرى.
es_es: Error al guardar el formulario. Por favor, inténtalo de nuevo.

source: Form deleted successfully!
ar: تم حذف النموذج بنجاح!
es_es: ¡Formulario eliminado exitosamente!

source: Error deleting form. Please try again.
ar: خطأ في حذف النموذج. يرجى المحاولة مرة أخرى.
es_es: Error al eliminar el formulario. Por favor, inténtalo de nuevo.

source: Please select a form in the block settings.
ar: يرجى تحديد نموذج في إعدادات الكتلة.
es_es: Por favor, selecciona un formulario en la configuración del bloque.

source: Form not found.
ar: النموذج غير موجود.
es_es: Formulario no encontrado.

source: Required field
ar: حقل مطلوب
es_es: Campo obligatorio

source: Submit
ar: إرسال
es_es: Enviar

source: Formshive Forms
ar: نماذج Formshive
es_es: Formularios Formshive

source: Manage your forms and embed them anywhere on your website.
ar: إدارة النماذج الخاصة بك وتضمينها في أي مكان على موقعك الإلكتروني.
es_es: Gestiona tus formularios e incorpóralos en cualquier lugar de tu sitio web.

source: No forms found.
ar: لم يتم العثور على نماذج.
es_es: No se encontraron formularios.

source: Create your first form to get started.
ar: قم بإنشاء نموذجك الأول للبدء.
es_es: Crea tu primer formulario para comenzar.

source: Form Name
ar: اسم النموذج
es_es: Nombre del formulario

source: Enter a descriptive name for this form.
ar: أدخل اسماً وصفياً لهذا النموذج.
es_es: Introduce un nombre descriptivo para este formulario.

source: Formshive URL
ar: رابط Formshive
es_es: URL de Formshive

source: Enter the complete Formshive form URL from your Formshive account.
ar: أدخل رابط نموذج Formshive الكامل من حساب Formshive الخاص بك.
es_es: Introduce la URL completa del formulario Formshive desde tu cuenta de Formshive.

source: Embed Options
ar: خيارات التضمين
es_es: Opciones de inserción

source: CSS Framework
ar: إطار عمل CSS
es_es: Framework CSS

source: Select the CSS framework for styling the embedded form.
ar: اختر إطار عمل CSS لتنسيق النموذج المضمن.
es_es: Selecciona el framework CSS para dar estilo al formulario insertado.

source: Update Form
ar: تحديث النموذج
es_es: Actualizar formulario

source: Save Form
ar: حفظ النموذج
es_es: Guardar formulario

source: Cancel
ar: إلغاء
es_es: Cancelar

source: Validating...
ar: جاري التحقق...
es_es: Validando...

source: Validation failed. Please try again.
ar: فشل التحقق. يرجى المحاولة مرة أخرى.
es_es: La validación falló. Por favor, inténtalo de nuevo.

source: Saving...
ar: جاري الحفظ...
es_es: Guardando...

source: Save failed. Please try again.
ar: فشل الحفظ. يرجى المحاولة مرة أخرى.
es_es: Error al guardar. Por favor, inténtalo de nuevo.

source: Formshive Settings
ar: إعدادات Formshive
es_es: Configuración de Formshive

source: API Endpoint
ar: نقطة نهاية API
es_es: Endpoint de API

source: The Formshive API endpoint URL. Do not change unless instructed.
ar: رابط نقطة نهاية API الخاص بـ Formshive. لا تقم بالتغيير إلا إذا تم توجيهك.
es_es: La URL del endpoint de la API de Formshive. No cambies a menos que se te indique.

source: Default CSS Framework
ar: إطار عمل CSS الافتراضي
es_es: Framework CSS predeterminado

source: Default CSS framework for new embedded forms.
ar: إطار عمل CSS الافتراضي للنماذج المضمنة الجديدة.
es_es: Framework CSS predeterminado para nuevos formularios insertados.

source: Development Mode
ar: وضع التطوير
es_es: Modo de desarrollo

source: Enable development mode features
ar: تفعيل ميزات وضع التطوير
es_es: Habilitar características del modo de desarrollo

source: Enables additional debugging and development features. Only visible when WP_DEBUG is enabled.
ar: يفعل ميزات إضافية لتصحيح الأخطاء والتطوير. مرئي فقط عند تفعيل WP_DEBUG.
es_es: Habilita características adicionales de depuración y desarrollo. Solo visible cuando WP_DEBUG está habilitado.

source: Usage Instructions
ar: تعليمات الاستخدام
es_es: Instrucciones de uso

source: Shortcode Usage
ar: استخدام الرمز المختصر
es_es: Uso de shortcode

source: Use the following shortcode to display your forms:
ar: استخدم الرمز المختصر التالي لعرض النماذج الخاصة بك:
es_es: Usa el siguiente shortcode para mostrar tus formularios:

source: Or by form ID:
ar: أو عن طريق معرف النموذج:
es_es: O por ID del formulario:

source: Gutenberg Block
ar: كتلة جوتنبرج
es_es: Bloque Gutenberg

source: Search for "Formshive" in the block inserter to add forms using the visual editor.
ar: ابحث عن "Formshive" في مدرج الكتل لإضافة النماذج باستخدام المحرر المرئي.
es_es: Busca "Formshive" en el insertor de bloques para añadir formularios usando el editor visual.

source: PHP Template Usage
ar: استخدام قالب PHP
es_es: Uso en plantillas PHP

source: Use in your theme templates:
ar: استخدم في قوالب القالب الخاص بك:
es_es: Usa en tus plantillas de tema:

source: Save Settings
ar: حفظ الإعدادات
es_es: Guardar configuración

source: Invalid Formshive URL. Please enter the complete URL from your Formshive account (e.g., https://api.formshive.com/v1/digest/your-form-id).
ar: رابط Formshive غير صحيح. يرجى إدخال الرابط الكامل من حساب Formshive الخاص بك (مثل: https://api.formshive.com/v1/digest/your-form-id).
es_es: URL de Formshive inválida. Por favor, introduce la URL completa desde tu cuenta de Formshive (ej: https://api.formshive.com/v1/digest/tu-id-formulario).
